In [2]:
import pandas as pd
data = {"name": ["shoaib","bilal","israr"],
       "age":[20,30,50],
       'City': ['New York', 'London', 'Paris']}
#setting index
dataframe=pd.DataFrame(data)
dataframe.set_index("name",inplace=True)
#inplace=True: replace the default index
print(dataframe)

        age      City
name
shoaib   20  New York
bilal    30    London
israr    50     Paris

In [ ]:
# Accessing the rows through indexing

In [4]:
row=dataframe.iloc[0]
print(row)

age           20
City    New York
Name: shoaib, dtype: object

In [ ]:
#Making An Array

In [5]:
data1=[1,2,3,4,5]
array1=pd.array(data1)
print(array1)

<IntegerArray>
[1, 2, 3, 4, 5]
Length: 5, dtype: Int64

In [ ]:
#For large data sets print() is unable so we use head(), tail() and info()

In [8]:
# create a dataframe
data = {'Name': ['John', 'Alice', 'Bob', 'Emma', 'Mike', 'Sarah', 'David', 'Linda', 'Tom', 'Emily'],
        'Age': [25, 30, 35, 28, 32, 27, 40, 33, 29, 31],
        'City': ['New York', 'Paris', 'London', 'Sydney', 'Tokyo', 'Berlin', 'Rome', 'Madrid', 'Toronto', 'Moscow']}
df = pd.DataFrame(data)

#first 3 lines
print(df.head(3))
print()

#as a default it takes 5 lines 
print(df.head())

#tail is same as head but takes last lines

#info() gives overall info.
print(df.info())

    Name  Age      City
0   John   25  New York
1  Alice   30     Paris
2    Bob   35    London

    Name  Age      City
0   John   25  New York
1  Alice   30     Paris
2    Bob   35    London
3   Emma   28    Sydney
4   Mike   32     Tokyo
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    10 non-null     object
 1   Age     10 non-null     int64
 2   City    10 non-null     object
dtypes: int64(1), object(2)
memory usage: 372.0+ bytes
None

In [53]:
import pandas as pd
data1=pd.read_excel(r"D:\OneDrive\Desktop\data analysis.xlsx")
data1
data1.set_index("name",inplace=True)
data1

        roll nom.  marks
name
shoaib         12    234
bilal          43    234
israr          56    236

In [15]:
#add new row
data1.loc["haroon"]=[12,345]
print(data1)

        roll nom.  marks
name
shoaib         12    234
bilal          43    234
israr          56    236
haroon         12    345

In [28]:
#add new column
data1.loc["haroon"]=[19,23,34]
data1
#for the modification of existing row ussi row ka name likh dp aur data pass krdo

        roll nom.  marks class
name
shoaib         12    234   4th
bilal          43    234   3rd
israr          56    236   5th
haroon         19     23    34

In [19]:
data1["class"]=["4th","3rd","5th","6th"]
data1

        roll nom.  marks class
name
shoaib         12    234   4th
bilal          43    234   3rd
israr          56    236   5th
haroon         19     19   6th

In [47]:
#remove row
data1.drop("israr")
data1

        roll nom.  marks class
name
israr          56    236   5th
haroon         19     23    34

In [48]:
#remove column
data1.drop("class",axis=1)
#axis 0 = rows
#axis 1= columns

        roll nom.  marks
name
israr          56    236
haroon         19     23

In [50]:
#rename columns
data1.rename(columns={"marks":"points"},inplace=True)
data1

        roll nom.  points class
name
israr          56     236   5th
haroon         19      23    34

In [52]:
#rename rows
#default
data1.rename({"haroon":"khan"},inplace=True)
data1

       roll nom.  points class
name
israr         56     236   5th
khan          19      23    34

# remove empty cells row

In [3]:
import pandas as pd
data1=pd.read_excel(r"D:\OneDrive\Desktop\data analysis.xlsx")
#removing empty cell row
data1.dropna(inplace=True)
data1
#didn't effect original data
data1.dropna()

     name  roll nom.  marks
0  shoaib         12    234
1   bilal         43    234
2   israr         56    236

# Replace empty cells with values

In [ ]:
#replce empty cell with value
data1.fillna(130,inplace=True)
#specified column
data1["column name"].fillna(130)

In [4]:
import pandas as pd
pp1=pd.read_excel("D:\OneDrive\Desktop\practice.xlsx")
pp1

     name calories protein  carbon  hydrogen
0  shoaib       40      34      43      22.0
1   bilal      NaN      34      34      33.0
2   israr       78      re      23      44.0
3    khan       56      56      67      55.0
4    alam       45      43      65      66.0
5    sher       40      77      45       NaN
6  haroon        9      43      87      77.0
7   niazi        7      98      77      89.0
8    khan      nnn       0       9      76.0
9    sher      456      87      85      56.0

# Mean Mode Median

In [9]:
mea1=pp1["hydrogen"].mean()
pp1["hydrogen"].fillna(mea1,inplace=True)
pp1

     name calories protein  carbon   hydrogen
0  shoaib       40      34      43  22.000000
1   bilal      NaN      34      34  33.000000
2   israr       78      re      23  44.000000
3    khan       56      56      67  55.000000
4    alam       45      43      65  66.000000
5    sher       40      77      45  57.555556
6  haroon        9      43      87  77.000000
7   niazi        7      98      77  89.000000
8    khan      nnn       0       9  76.000000
9    sher      456      87      85  56.000000

In [ ]:
#use .loc for name access
#use .iloc for index access
#access row by name
row=data['name of row']
#access row by index
row=data.iloc[0]
#access column by name
column=data["name of column"]
#by index
column=data.iloc[0]
#access multiple columns
column=data[['Rank','Name']]
column

In [ ]:
data.dropna(axis=0) #for row
data.dropna(axis=1) #for column
data.dropna(subset=["Rank","Name"],inplace=True)
data.head(15)

In [ ]:
#checking null values
data.isnull().sum()
data.columnname.value_counts()
data.columnname.unique()

In [ ]:
data.column.replace('Not Provided',np.nan)
data.columnname=pd.to_numeric(data.columnname,errors='coerce')